; ModuleID = 'kern.c'
source_filename = "kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, %struct.source_state*, [4 x i32]* }
%struct.source_state = type { i64, i64, i64, i64, i64, i64 }
%struct.anon.0 = type { [2 x i32]*, i32*, i64*, [1 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@source_states = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !15
@queue_length_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !46
@llvm.used = appending global [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.anon.0* @queue_length_map to i8*), i8* bitcast (%struct.anon* @source_states to i8*), i8* bitcast (i32 (%struct.xdp_md*)* @xdp_redirect_map_func to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local i32 @xdp_redirect_map_func(%struct.xdp_md* nocapture readnone %0) #0 section "xdp_redirect_map" !dbg !81 {
  %2 = alloca i32, align 4
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca i32, align 4
  call void @llvm.dbg.value(metadata %struct.xdp_md* undef, metadata !93, metadata !DIExpression()), !dbg !94
  %7 = bitcast i32* %6 to i8*, !dbg !95
  call void @llvm.lifetime.start.p0i8(i64 4, i8* nonnull %7), !dbg !95

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 86, type: !75, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "kern.c", directory: "/home/shrestha/btp/pktsniff/xdp/packet/redirecting/self_similar_traf/c")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3153, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!0, !15, !46, !59, !66}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "source_states", scope: !2, file: !3, line: 25, type: !17, isLocal: false, isDefinition: true)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 256, elements: !18)
!18 = !{!19, !25, !29, !41}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !3, line: 21, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !23)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !{!24}
!24 = !DISubrange(count: 2)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !17, file: !3, line: 22, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !28, line: 27, baseType: !7)
!28 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !3, line: 23, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "source_state", file: !3, line: 11, size: 384, elements: !32)
!32 = !{!33, !36, !37, !38, !39, !40}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !31, file: !3, line: 12, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !28, line: 31, baseType: !35)
!35 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "intensity1", scope: !31, file: !3, line: 13, baseType: !34, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "intensity2", scope: !31, file: !3, line: 14, baseType: !34, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "transition_rate1", scope: !31, file: !3, line: 15, baseType: !34, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "transition_rate2", scope: !31, file: !3, line: 16, baseType: !34, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !31, file: !3, line: 17, baseType: !34, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !17, file: !3, line: 24, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 4)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "queue_length_map", scope: !2, file: !3, line: 32, type: !48, isLocal: false, isDefinition: true)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 27, size: 256, elements: !49)
!49 = !{!50, !51, !52, !54}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !3, line: 28, baseType: !20, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !48, file: !3, line: 29, baseType: !26, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !48, file: !3, line: 30, baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !48, file: !3, line: 31, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !61, line: 114, type: !62, isLocal: true, isDefinition: true)
!61 = !DIFile(filename: "/usr/local/include/bpf/bpf_helper_defs.h", directory: "")
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!34}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !61, line: 56, type: !68, isLocal: true, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !72, !73}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !44)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !{i32 7, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{!"Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5"}
!81 = distinct !DISubprogram(name: "xdp_redirect_map_func", scope: !3, file: !3, line: 76, type: !82, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !92)
!82 = !DISubroutineType(types: !83)
!83 = !{!22, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 3165, baseType: !27, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !85, file: !6, line: 3166, baseType: !27, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !85, file: !6, line: 3167, baseType: !27, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !85, file: !6, line: 3169, baseType: !27, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !85, file: !6, line: 3170, baseType: !27, size: 32, offset: 128)
!92 = !{!93}
!93 = !DILocalVariable(name: "ctx", arg: 1, scope: !81, file: !3, line: 76, type: !84)
!94 = !DILocation(line: 0, scope: !81)
!95 = !DILocation(line: 0, scope: !96, inlinedAt: !108)
!96 = distinct !DISubprogram(name: "update_source_state", scope: !3, file: !3, line: 34, type: !97, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !27}
!99 = !{!100, !101, !102, !103, !106, !107}
!100 = !DILocalVariable(name: "i", arg: 1, scope: !96, file: !3, line: 34, type: !27)
!101 = !DILocalVariable(name: "now", scope: !96, file: !3, line: 35, type: !34)
!102 = !DILocalVariable(name: "state", scope: !96, file: !3, line: 36, type: !30)
!103 = !DILocalVariable(name: "time_elapsed", scope: !104, file: !3, line: 39, type: !34)
!104 = distinct !DILexicalBlock(scope: !105, file: !3, line: 38, column: 14)
!105 = distinct !DILexicalBlock(scope: !96, file: !3, line: 38, column: 7)
!106 = !DILocalVariable(name: "rate1_ns", scope: !104, file: !3, line: 42, type: !34)
!107 = !DILocalVariable(name: "rate2_ns", scope: !104, file: !3, line: 43, type: !34)
!108 = distinct !DILocation(line: 78, column: 3, scope: !81)
!109 = !{!110, !110, i64 0}
!110 = !{!"int", !111, i64 0}
!111 = !{!"omnipotent char", !112, i64 0}
!112 = !{!"Simple C/C++ TBAA"}
!113 = !DILocation(line: 35, column: 15, scope: !96, inlinedAt: !108)
!114 = !DILocation(line: 36, column: 32, scope: !96, inlinedAt: !108)
!115 = !DILocation(line: 38, column: 7, scope: !105, inlinedAt: !108)
!116 = !DILocation(line: 38, column: 7, scope: !96, inlinedAt: !108)
!117 = !DILocation(line: 39, column: 39, scope: !104, inlinedAt: !108)
!118 = !{!119, !120, i64 40}
!119 = !{!"source_state", !120, i64 0, !120, i64 8, !120, i64 16, !120, i64 24, !120, i64 32, !120, i64 40}
!120 = !{!"long long", !111, i64 0}
!121 = !DILocation(line: 39, column: 30, scope: !104, inlinedAt: !108)
!122 = !DILocation(line: 0, scope: !104, inlinedAt: !108)
!123 = !DILocation(line: 46, column: 16, scope: !124, inlinedAt: !108)
!124 = distinct !DILexicalBlock(scope: !104, file: !3, line: 46, column: 9)
!125 = !{!119, !120, i64 0}
!126 = !DILocation(line: 46, column: 9, scope: !124, inlinedAt: !108)
!127 = !DILocation(line: 46, column: 23, scope: !124, inlinedAt: !108)
!128 = !DILocation(line: 42, column: 29, scope: !104, inlinedAt: !108)
!129 = !{!119, !120, i64 24}
!130 = !DILocation(line: 42, column: 46, scope: !104, inlinedAt: !108)
!131 = !DILocation(line: 46, column: 39, scope: !124, inlinedAt: !108)
!132 = !DILocation(line: 46, column: 9, scope: !104, inlinedAt: !108)
!133 = !DILocation(line: 47, column: 21, scope: !134, inlinedAt: !108)
!134 = distinct !DILexicalBlock(scope: !124, file: !3, line: 46, column: 51)
!135 = !DILocation(line: 48, column: 30, scope: !134, inlinedAt: !108)
!136 = !DILocation(line: 49, column: 5, scope: !134, inlinedAt: !108)
!137 = !DILocation(line: 43, column: 29, scope: !104, inlinedAt: !108)
!138 = !{!119, !120, i64 32}
!139 = !DILocation(line: 43, column: 46, scope: !104, inlinedAt: !108)
!140 = !DILocation(line: 51, column: 29, scope: !141, inlinedAt: !108)
!141 = distinct !DILexicalBlock(scope: !124, file: !3, line: 51, column: 14)
!142 = !DILocation(line: 52, column: 21, scope: !143, inlinedAt: !108)
!143 = distinct !DILexicalBlock(scope: !141, file: !3, line: 51, column: 57)
!144 = !DILocation(line: 53, column: 30, scope: !143, inlinedAt: !108)
!145 = !DILocation(line: 54, column: 5, scope: !143, inlinedAt: !108)
!146 = !DILocation(line: 56, column: 1, scope: !96, inlinedAt: !108)
!147 = !DILocation(line: 0, scope: !96, inlinedAt: !148)
!148 = distinct !DILocation(line: 79, column: 3, scope: !81)
!149 = !DILocation(line: 35, column: 15, scope: !96, inlinedAt: !148)
