; ModuleID = 'continuous_burst_network/c/kern.c'
source_filename = "continuous_burst_network/c/kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, i64*, [1 x i32]* }
%struct.anon.0 = type { [1 x i32]*, [6 x i8]*, [6 x i8]*, [1 x i32]* }
%struct.anon.1 = type { [14 x i32]*, i32*, i32*, [256 x i32]* }
%struct.anon.2 = type { [2 x i32]*, i32*, %struct.datarec*, [5 x i32]* }
%struct.datarec = type { i64, i64, i64 }
%struct.anon.3 = type { [2 x i32]*, i32*, %struct.telrec*, [5 x i32]* }
%struct.telrec = type { i64, i64, i64 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@queue_avg_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@redirect_params = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !115
@tx_port = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !99
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !55
@xdp_stats_map = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !61
@telemetry_stats_map = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !85

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "queue_avg_map", scope: !2, file: !3, line: 69, type: !132, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "continuous_burst_network/c/kern.c", directory: "/home/shrestha/btp/designs/eBPF")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3153, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18, !28, !36, !42, !49, !55, !61, !85, !99, !115, !0}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !20, line: 114, type: !21, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "/usr/local/include/bpf/bpf_helper_defs.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !26, line: 31, baseType: !27)
!26 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!27 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !20, line: 56, type: !30, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!15, !15, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !20, line: 78, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!16, !15, !34, !34, !25}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !20, line: 193, type: !44, isLocal: true, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !26, line: 27, baseType: !7)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !20, line: 1325, type: !51, isLocal: true, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !15, !25, !25}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 195, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 4)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 41, type: !63, isLocal: false, isDefinition: true)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 36, size: 256, elements: !64)
!64 = !{!65, !71, !73, !80}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !3, line: 37, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !69)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !3, line: 38, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !3, line: 39, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !3, line: 24, size: 192, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !75, file: !3, line: 25, baseType: !25, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !75, file: !3, line: 26, baseType: !25, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last_rxpackets", scope: !75, file: !3, line: 27, baseType: !25, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !3, line: 40, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 5)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "telemetry_stats_map", scope: !2, file: !3, line: 48, type: !87, isLocal: false, isDefinition: true)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 43, size: 256, elements: !88)
!88 = !{!89, !90, !91, !98}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !3, line: 44, baseType: !66, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !87, file: !3, line: 45, baseType: !72, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !3, line: 46, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telrec", file: !3, line: 30, size: 192, elements: !94)
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !93, file: !3, line: 31, baseType: !25, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "processing_time", scope: !93, file: !3, line: 32, baseType: !25, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !93, file: !3, line: 33, baseType: !25, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !87, file: !3, line: 47, baseType: !81, size: 64, offset: 192)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 55, type: !101, isLocal: false, isDefinition: true)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 50, size: 256, elements: !102)
!102 = !{!103, !108, !109, !110}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !3, line: 51, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 448, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 14)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !101, file: !3, line: 52, baseType: !72, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !3, line: 53, baseType: !72, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !101, file: !3, line: 54, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 256)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 62, type: !117, isLocal: false, isDefinition: true)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 57, size: 256, elements: !118)
!118 = !{!119, !124, !130, !131}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !3, line: 58, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 1)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !117, file: !3, line: 59, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 48, elements: !128)
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !{!129}
!129 = !DISubrange(count: 6)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !117, file: !3, line: 60, baseType: !125, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !117, file: !3, line: 61, baseType: !120, size: 64, offset: 192)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 64, size: 256, elements: !133)
!133 = !{!134, !135, !136, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !3, line: 65, baseType: !66, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !132, file: !3, line: 66, baseType: !72, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !132, file: !3, line: 67, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !132, file: !3, line: 68, baseType: !120, size: 64, offset: 192)
!139 = !{i32 7, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = !{!"Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5"}
!143 = distinct !DISubprogram(name: "xdp_redirect_map_func", scope: !3, file: !3, line: 138, type: !144, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!144 = !DISubroutineType(types: !145)
!145 = !{!68, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !148)
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !6, line: 3165, baseType: !48, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !147, file: !6, line: 3166, baseType: !48, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !147, file: !6, line: 3167, baseType: !48, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !147, file: !6, line: 3169, baseType: !48, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !147, file: !6, line: 3170, baseType: !48, size: 32, offset: 128)
!154 = !{!155, !156, !157, !158, !159, !171, !172, !173, !174, !175, !176, !177, !181, !183, !184}
!155 = !DILocalVariable(name: "ctx", arg: 1, scope: !143, file: !3, line: 138, type: !146)
!156 = !DILocalVariable(name: "start", scope: !143, file: !3, line: 139, type: !25)
!157 = !DILocalVariable(name: "data_end", scope: !143, file: !3, line: 140, type: !15)
!158 = !DILocalVariable(name: "data", scope: !143, file: !3, line: 141, type: !15)
!159 = !DILocalVariable(name: "eth", scope: !143, file: !3, line: 143, type: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !162, line: 163, size: 112, elements: !163)
!162 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !161, file: !162, line: 164, baseType: !126, size: 48)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !161, file: !162, line: 165, baseType: !126, size: 48, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !161, file: !162, line: 166, baseType: !167, size: 16, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !168, line: 25, baseType: !169)
!168 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !26, line: 24, baseType: !170)
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !DILocalVariable(name: "action", scope: !143, file: !3, line: 144, type: !48)
!172 = !DILocalVariable(name: "queue_len", scope: !143, file: !3, line: 145, type: !25)
!173 = !DILocalVariable(name: "key", scope: !143, file: !3, line: 146, type: !48)
!174 = !DILocalVariable(name: "prev_avg", scope: !143, file: !3, line: 148, type: !137)
!175 = !DILocalVariable(name: "is_burst", scope: !143, file: !3, line: 154, type: !25)
!176 = !DILocalVariable(name: "new_avg", scope: !143, file: !3, line: 158, type: !25)
!177 = !DILocalVariable(name: "drop_prob", scope: !178, file: !3, line: 166, type: !25)
!178 = distinct !DILexicalBlock(scope: !179, file: !3, line: 165, column: 10)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 163, column: 14)
!180 = distinct !DILexicalBlock(scope: !143, file: !3, line: 161, column: 7)
!181 = !DILocalVariable(name: "dst", scope: !143, file: !3, line: 179, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!183 = !DILocalVariable(name: "iface_index", scope: !143, file: !3, line: 185, type: !72)
!184 = !DILabel(scope: !143, name: "out", file: !3, line: 191)
!185 = !DILocation(line: 0, scope: !143)
!186 = !DILocation(line: 139, column: 17, scope: !143)
!187 = !DILocation(line: 140, column: 39, scope: !143)
!188 = !{!189, !190, i64 4}
!189 = !{!"xdp_md", !190, i64 0, !190, i64 4, !190, i64 8, !190, i64 12, !190, i64 16}
!190 = !{!"int", !191, i64 0}
!191 = !{!"omnipotent char", !192, i64 0}
!192 = !{!"Simple C/C++ TBAA"}
!193 = !DILocation(line: 140, column: 28, scope: !143)
!194 = !DILocation(line: 140, column: 20, scope: !143)
!195 = !DILocation(line: 141, column: 35, scope: !143)
!196 = !{!189, !190, i64 0}
!197 = !DILocation(line: 141, column: 24, scope: !143)
!198 = !DILocation(line: 141, column: 16, scope: !143)
!199 = !DILocation(line: 146, column: 3, scope: !143)
!200 = !DILocation(line: 146, column: 9, scope: !143)
!201 = !{!190, !190, i64 0}
!202 = !DILocation(line: 148, column: 21, scope: !143)
!203 = !DILocation(line: 149, column: 8, scope: !204)
!204 = distinct !DILexicalBlock(scope: !143, file: !3, line: 149, column: 7)
!205 = !DILocation(line: 149, column: 7, scope: !143)
!206 = !DILocation(line: 0, scope: !207, inlinedAt: !218)
!207 = distinct !DISubprogram(name: "handle_burst_detection", scope: !3, file: !3, line: 81, type: !208, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!68, !48, !25}
!210 = !{!211, !212, !213, !214, !215, !216, !217}
!211 = !DILocalVariable(name: "action", arg: 1, scope: !207, file: !3, line: 81, type: !48)
!212 = !DILocalVariable(name: "current_time", arg: 2, scope: !207, file: !3, line: 82, type: !25)
!213 = !DILocalVariable(name: "stats", scope: !207, file: !3, line: 83, type: !74)
!214 = !DILocalVariable(name: "telemetry", scope: !207, file: !3, line: 84, type: !92)
!215 = !DILocalVariable(name: "queue_len", scope: !207, file: !3, line: 85, type: !137)
!216 = !DILocalVariable(name: "elapsed_time", scope: !207, file: !3, line: 96, type: !25)
!217 = !DILocalVariable(name: "rps", scope: !207, file: !3, line: 101, type: !25)
!218 = distinct !DILocation(line: 154, column: 20, scope: !143)
!219 = !DILocation(line: 83, column: 27, scope: !207, inlinedAt: !218)
!220 = !DILocation(line: 84, column: 30, scope: !207, inlinedAt: !218)
!221 = !DILocation(line: 85, column: 59, scope: !207, inlinedAt: !218)
