; ModuleID = 'continuous_burst_network/c/kern.c'
source_filename = "continuous_burst_network/c/kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, %struct.datarec*, [5 x i32]* }
%struct.datarec = type { i64, i64 }
%struct.anon.0 = type { [2 x i32]*, i32*, %struct.telrec*, [5 x i32]* }
%struct.telrec = type { i64, i64 }
%struct.anon.1 = type { [2 x i32]*, i32*, i64*, [1 x i32]* }
%struct.anon.2 = type { [1 x i32]*, [6 x i8]*, [6 x i8]*, [1 x i32]* }
%struct.anon.3 = type { [14 x i32]*, i32*, i32*, [256 x i32]* }
%struct.anon.4 = type { [2 x i32]*, i32*, i64*, [5 x i32]* }
%struct.anon.5 = type { [2 x i32]*, i32*, i64*, [5 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@xdp_stats_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@telemetry_stats_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !61
@queue_avg_map = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !117
@redirect_params = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !100
@tx_port = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !84
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !55

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 40, type: !142, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "continuous_burst_network/c/kern.c", directory: "/home/shrestha/btp/designs/eBPF")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3153, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18, !28, !36, !42, !49, !55, !0, !61, !84, !100, !117, !126, !134}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !20, line: 114, type: !21, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "/usr/local/include/bpf/bpf_helper_defs.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !26, line: 31, baseType: !27)
!26 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!27 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !20, line: 56, type: !30, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!15, !15, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !20, line: 78, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!16, !15, !34, !34, !25}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !20, line: 193, type: !44, isLocal: true, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !26, line: 27, baseType: !7)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !20, line: 1325, type: !51, isLocal: true, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !15, !25, !25}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 252, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 4)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "telemetry_stats_map", scope: !2, file: !3, line: 47, type: !63, isLocal: false, isDefinition: true)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 256, elements: !64)
!64 = !{!65, !71, !73, !79}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !3, line: 43, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !69)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !3, line: 44, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !3, line: 45, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telrec", file: !3, line: 29, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !75, file: !3, line: 30, baseType: !25, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "processing_time", scope: !75, file: !3, line: 31, baseType: !25, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !3, line: 46, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 5)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 54, type: !86, isLocal: false, isDefinition: true)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 49, size: 256, elements: !87)
!87 = !{!88, !93, !94, !95}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !3, line: 50, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 448, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 14)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !86, file: !3, line: 51, baseType: !72, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !3, line: 52, baseType: !72, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !86, file: !3, line: 53, baseType: !96, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 256)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 61, type: !102, isLocal: false, isDefinition: true)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 56, size: 256, elements: !103)
!103 = !{!104, !109, !115, !116}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !3, line: 57, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !102, file: !3, line: 58, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 48, elements: !113)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !{!114}
!114 = !DISubrange(count: 6)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !102, file: !3, line: 59, baseType: !110, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !102, file: !3, line: 60, baseType: !105, size: 64, offset: 192)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "queue_avg_map", scope: !2, file: !3, line: 68, type: !119, isLocal: false, isDefinition: true)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 63, size: 256, elements: !120)
!120 = !{!121, !122, !123, !125}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !3, line: 64, baseType: !66, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !119, file: !3, line: 65, baseType: !72, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !3, line: 66, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !119, file: !3, line: 67, baseType: !105, size: 64, offset: 192)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "last_timestamp_map", scope: !2, file: !3, line: 75, type: !128, isLocal: false, isDefinition: true)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 70, size: 256, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !3, line: 71, baseType: !66, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !128, file: !3, line: 72, baseType: !72, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !128, file: !3, line: 73, baseType: !124, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !128, file: !3, line: 74, baseType: !80, size: 64, offset: 192)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "request_count_map", scope: !2, file: !3, line: 82, type: !136, isLocal: false, isDefinition: true)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 77, size: 256, elements: !137)
!137 = !{!138, !139, !140, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !3, line: 78, baseType: !66, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !136, file: !3, line: 79, baseType: !72, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !136, file: !3, line: 80, baseType: !124, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !136, file: !3, line: 81, baseType: !80, size: 64, offset: 192)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 256, elements: !143)
!143 = !{!144, !145, !146, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !3, line: 36, baseType: !66, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !142, file: !3, line: 37, baseType: !72, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !142, file: !3, line: 38, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !3, line: 24, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !148, file: !3, line: 25, baseType: !25, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !148, file: !3, line: 26, baseType: !25, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !142, file: !3, line: 39, baseType: !80, size: 64, offset: 192)
!153 = !{i32 7, !"Dwarf Version", i32 4}
!154 = !{i32 2, !"Debug Info Version", i32 3}
!155 = !{i32 1, !"wchar_size", i32 4}
!156 = !{!"Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5"}
!157 = distinct !DISubprogram(name: "xdp_redirect_map_func", scope: !3, file: !3, line: 171, type: !158, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !168)
!158 = !DISubroutineType(types: !159)
!159 = !{!68, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !162)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !6, line: 3165, baseType: !48, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !161, file: !6, line: 3166, baseType: !48, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !161, file: !6, line: 3167, baseType: !48, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !161, file: !6, line: 3169, baseType: !48, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !161, file: !6, line: 3170, baseType: !48, size: 32, offset: 128)
!168 = !{!169, !170, !171, !172, !173, !185, !186, !187, !188, !189, !190, !191, !192, !193, !197, !199, !200}
!169 = !DILocalVariable(name: "ctx", arg: 1, scope: !157, file: !3, line: 171, type: !160)
!170 = !DILocalVariable(name: "start", scope: !157, file: !3, line: 172, type: !25)
!171 = !DILocalVariable(name: "data_end", scope: !157, file: !3, line: 173, type: !15)
!172 = !DILocalVariable(name: "data", scope: !157, file: !3, line: 174, type: !15)
!173 = !DILocalVariable(name: "eth", scope: !157, file: !3, line: 176, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !176, line: 163, size: 112, elements: !177)
!176 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !175, file: !176, line: 164, baseType: !111, size: 48)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !175, file: !176, line: 165, baseType: !111, size: 48, offset: 48)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !175, file: !176, line: 166, baseType: !181, size: 16, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !182, line: 25, baseType: !183)
!182 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !26, line: 24, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DILocalVariable(name: "action", scope: !157, file: !3, line: 177, type: !48)
!186 = !DILocalVariable(name: "queue_len", scope: !157, file: !3, line: 178, type: !25)
!187 = !DILocalVariable(name: "key", scope: !157, file: !3, line: 180, type: !48)
!188 = !DILocalVariable(name: "rec", scope: !157, file: !3, line: 183, type: !147)
!189 = !DILocalVariable(name: "telemetry", scope: !157, file: !3, line: 184, type: !74)
!190 = !DILocalVariable(name: "is_burst", scope: !157, file: !3, line: 185, type: !68)
!191 = !DILocalVariable(name: "prev_avg", scope: !157, file: !3, line: 197, type: !124)
!192 = !DILocalVariable(name: "new_avg", scope: !157, file: !3, line: 204, type: !25)
!193 = !DILocalVariable(name: "drop_prob", scope: !194, file: !3, line: 214, type: !25)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 213, column: 10)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 211, column: 14)
!196 = distinct !DILexicalBlock(scope: !157, file: !3, line: 208, column: 7)
!197 = !DILocalVariable(name: "dst", scope: !157, file: !3, line: 234, type: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!199 = !DILocalVariable(name: "iface_index", scope: !157, file: !3, line: 242, type: !72)
!200 = !DILabel(scope: !157, name: "out", file: !3, line: 248)
!201 = !DILocation(line: 0, scope: !157)
!202 = !DILocation(line: 172, column: 17, scope: !157)
!203 = !DILocation(line: 173, column: 39, scope: !157)
!204 = !{!205, !206, i64 4}
!205 = !{!"xdp_md", !206, i64 0, !206, i64 4, !206, i64 8, !206, i64 12, !206, i64 16}
!206 = !{!"int", !207, i64 0}
!207 = !{!"omnipotent char", !208, i64 0}
!208 = !{!"Simple C/C++ TBAA"}
!209 = !DILocation(line: 173, column: 28, scope: !157)
!210 = !DILocation(line: 173, column: 20, scope: !157)
!211 = !DILocation(line: 174, column: 35, scope: !157)
!212 = !{!205, !206, i64 0}
!213 = !DILocation(line: 174, column: 24, scope: !157)
!214 = !DILocation(line: 174, column: 16, scope: !157)
!215 = !DILocation(line: 180, column: 3, scope: !157)
!216 = !DILocation(line: 180, column: 9, scope: !157)
!217 = !{!206, !206, i64 0}
!218 = !DILocation(line: 183, column: 25, scope: !157)
!219 = !DILocation(line: 184, column: 30, scope: !157)
!220 = !DILocation(line: 187, column: 7, scope: !221)
!221 = distinct !DILexicalBlock(scope: !157, file: !3, line: 187, column: 7)
!222 = !DILocation(line: 187, column: 11, scope: !221)
!223 = !DILocation(line: 188, column: 39, scope: !224)
!224 = distinct !DILexicalBlock(scope: !221, file: !3, line: 187, column: 25)
!225 = !DILocation(line: 0, scope: !226, inlinedAt: !247)
!226 = distinct !DISubprogram(name: "handle_burst_detection", scope: !3, file: !3, line: 92, type: !227, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{!68, !48, !147, !74}
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !240, !241, !244}
!230 = !DILocalVariable(name: "key", arg: 1, scope: !226, file: !3, line: 92, type: !48)
!231 = !DILocalVariable(name: "stats", arg: 2, scope: !226, file: !3, line: 93, type: !147)
!232 = !DILocalVariable(name: "telemetry", arg: 3, scope: !226, file: !3, line: 94, type: !74)
!233 = !DILocalVariable(name: "last_timestamp", scope: !226, file: !3, line: 95, type: !124)
!234 = !DILocalVariable(name: "request_count", scope: !226, file: !3, line: 96, type: !124)
