; ModuleID = 'kern.c'
source_filename = "kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [2 x i32]*, i32*, i64*, [1 x i32]* }
%struct.anon.0 = type { [1 x i32]*, [6 x i8]*, [6 x i8]*, [1 x i32]* }
%struct.anon.1 = type { [14 x i32]*, i32*, i32*, [256 x i32]* }
%struct.anon.2 = type { [2 x i32]*, i32*, %struct.datarec*, [5 x i32]* }
%struct.datarec = type { i64, i64 }
%struct.anon.3 = type { [2 x i32]*, i32*, %struct.telrec*, [5 x i32]* }
%struct.telrec = type { i64, i64 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }

@queue_avg_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@redirect_params = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !113
@tx_port = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !97
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !55
@xdp_stats_map = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !61
@telemetry_stats_map = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !84

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "queue_avg_map", scope: !2, file: !3, line: 67, type: !130, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "kern.c", directory: "/home/shrestha/btp/pktsniff/xdp/packet/redirecting/bursty_traffic/c")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3153, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18, !28, !36, !42, !49, !55, !61, !84, !97, !113, !0}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !20, line: 114, type: !21, isLocal: true, isDefinition: true)
!20 = !DIFile(filename: "/usr/local/include/bpf/bpf_helper_defs.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !26, line: 31, baseType: !27)
!26 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!27 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !20, line: 56, type: !30, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!15, !15, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !20, line: 78, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!16, !15, !34, !34, !25}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !20, line: 193, type: !44, isLocal: true, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !26, line: 27, baseType: !7)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !20, line: 1325, type: !51, isLocal: true, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !15, !25, !25}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 193, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 4)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 39, type: !63, isLocal: false, isDefinition: true)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 34, size: 256, elements: !64)
!64 = !{!65, !71, !73, !79}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !3, line: 35, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !69)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !3, line: 36, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !3, line: 37, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !3, line: 24, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !75, file: !3, line: 25, baseType: !25, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !75, file: !3, line: 26, baseType: !25, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !3, line: 38, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 5)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "telemetry_stats_map", scope: !2, file: !3, line: 46, type: !86, isLocal: false, isDefinition: true)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 41, size: 256, elements: !87)
!87 = !{!88, !89, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !3, line: 42, baseType: !66, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !86, file: !3, line: 43, baseType: !72, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !3, line: 44, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telrec", file: !3, line: 29, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !92, file: !3, line: 30, baseType: !25, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "processing_time", scope: !92, file: !3, line: 31, baseType: !25, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !86, file: !3, line: 45, baseType: !80, size: 64, offset: 192)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 53, type: !99, isLocal: false, isDefinition: true)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 48, size: 256, elements: !100)
!100 = !{!101, !106, !107, !108}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !3, line: 49, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 448, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 14)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !99, file: !3, line: 50, baseType: !72, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !3, line: 51, baseType: !72, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !99, file: !3, line: 52, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 256)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 60, type: !115, isLocal: false, isDefinition: true)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 55, size: 256, elements: !116)
!116 = !{!117, !122, !128, !129}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !3, line: 56, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !115, file: !3, line: 57, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 48, elements: !126)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 6)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !115, file: !3, line: 58, baseType: !123, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !115, file: !3, line: 59, baseType: !118, size: 64, offset: 192)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 62, size: 256, elements: !131)
!131 = !{!132, !133, !134, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !3, line: 63, baseType: !66, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !130, file: !3, line: 64, baseType: !72, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !130, file: !3, line: 65, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !130, file: !3, line: 66, baseType: !118, size: 64, offset: 192)
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{!"Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214622.5"}
!141 = distinct !DISubprogram(name: "xdp_redirect_map_func", scope: !3, file: !3, line: 131, type: !142, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !152)
!142 = !DISubroutineType(types: !143)
!143 = !{!68, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3164, size: 160, elements: !146)
!146 = !{!147, !148, !149, !150, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !6, line: 3165, baseType: !48, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !145, file: !6, line: 3166, baseType: !48, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !145, file: !6, line: 3167, baseType: !48, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !145, file: !6, line: 3169, baseType: !48, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !145, file: !6, line: 3170, baseType: !48, size: 32, offset: 128)
!152 = !{!153, !154, !155, !156, !157, !169, !170, !171, !172, !173, !174, !178, !180, !181}
!153 = !DILocalVariable(name: "ctx", arg: 1, scope: !141, file: !3, line: 131, type: !144)
!154 = !DILocalVariable(name: "start", scope: !141, file: !3, line: 132, type: !25)
!155 = !DILocalVariable(name: "data_end", scope: !141, file: !3, line: 134, type: !15)
!156 = !DILocalVariable(name: "data", scope: !141, file: !3, line: 135, type: !15)
!157 = !DILocalVariable(name: "eth", scope: !141, file: !3, line: 137, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !160, line: 163, size: 112, elements: !161)
!160 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!161 = !{!162, !163, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !159, file: !160, line: 164, baseType: !124, size: 48)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !159, file: !160, line: 165, baseType: !124, size: 48, offset: 48)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !159, file: !160, line: 166, baseType: !165, size: 16, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !166, line: 25, baseType: !167)
!166 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !26, line: 24, baseType: !168)
!168 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!169 = !DILocalVariable(name: "action", scope: !141, file: !3, line: 138, type: !48)
!170 = !DILocalVariable(name: "queue_len", scope: !141, file: !3, line: 139, type: !25)
!171 = !DILocalVariable(name: "key", scope: !141, file: !3, line: 140, type: !48)
!172 = !DILocalVariable(name: "prev_avg", scope: !141, file: !3, line: 142, type: !135)
!173 = !DILocalVariable(name: "new_avg", scope: !141, file: !3, line: 150, type: !25)
!174 = !DILocalVariable(name: "drop_prob", scope: !175, file: !3, line: 160, type: !25)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 158, column: 10)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 156, column: 14)
!177 = distinct !DILexicalBlock(scope: !141, file: !3, line: 153, column: 7)
!178 = !DILocalVariable(name: "dst", scope: !141, file: !3, line: 176, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!180 = !DILocalVariable(name: "iface_index", scope: !141, file: !3, line: 183, type: !72)
!181 = !DILabel(scope: !141, name: "out", file: !3, line: 189)
!182 = !DILocation(line: 0, scope: !141)
!183 = !DILocation(line: 132, column: 17, scope: !141)
!184 = !DILocation(line: 134, column: 39, scope: !141)
!185 = !{!186, !187, i64 4}
!186 = !{!"xdp_md", !187, i64 0, !187, i64 4, !187, i64 8, !187, i64 12, !187, i64 16}
!187 = !{!"int", !188, i64 0}
!188 = !{!"omnipotent char", !189, i64 0}
!189 = !{!"Simple C/C++ TBAA"}
!190 = !DILocation(line: 134, column: 28, scope: !141)
!191 = !DILocation(line: 134, column: 20, scope: !141)
!192 = !DILocation(line: 135, column: 35, scope: !141)
!193 = !{!186, !187, i64 0}
!194 = !DILocation(line: 135, column: 24, scope: !141)
!195 = !DILocation(line: 135, column: 16, scope: !141)
!196 = !DILocation(line: 140, column: 3, scope: !141)
!197 = !DILocation(line: 140, column: 9, scope: !141)
!198 = !{!187, !187, i64 0}
!199 = !DILocation(line: 142, column: 21, scope: !141)
!200 = !DILocation(line: 143, column: 8, scope: !201)
!201 = distinct !DILexicalBlock(scope: !141, file: !3, line: 143, column: 7)
!202 = !DILocation(line: 143, column: 7, scope: !141)
!203 = !DILocation(line: 0, scope: !204, inlinedAt: !220)
!204 = distinct !DISubprogram(name: "handle_burst_detection", scope: !3, file: !3, line: 78, type: !205, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !48}
!207 = !{!208, !209, !210, !211, !212, !213, !216, !219}
!208 = !DILocalVariable(name: "action", arg: 1, scope: !204, file: !3, line: 78, type: !48)
!209 = !DILocalVariable(name: "stats", scope: !204, file: !3, line: 79, type: !74)
!210 = !DILocalVariable(name: "telemetry", scope: !204, file: !3, line: 80, type: !91)
!211 = !DILocalVariable(name: "initial_queue_len", scope: !204, file: !3, line: 81, type: !135)
!212 = !DILocalVariable(name: "delta_time", scope: !204, file: !3, line: 86, type: !25)
!213 = !DILocalVariable(name: "rps", scope: !214, file: !3, line: 90, type: !25)
!214 = distinct !DILexicalBlock(scope: !215, file: !3, line: 89, column: 23)
!215 = distinct !DILexicalBlock(scope: !204, file: !3, line: 89, column: 7)
!216 = !DILocalVariable(name: "key", scope: !217, file: !3, line: 97, type: !48)
!217 = distinct !DILexicalBlock(scope: !218, file: !3, line: 95, column: 35)
!218 = distinct !DILexicalBlock(scope: !214, file: !3, line: 95, column: 9)
